// あんこスキル関連

export const ASKILL_COSTS = {
    s1: 0, s2_1: 1, s2_2: 1,
    s3_1: 2, s3_2: 2,
    s4: 3,
    s5_1: 8, s5_2: 8, s5_3: 12,
    s6_1: 15, s6_2: 15, s6_3: 20,
    s7_1: 30, s7_2: 40, s7_3: 35,
    s8: 512,
    s9_1: 900, s9_2: 800,
    s10_1: 1050, s10_2: 800, s10_3: 800,
    s11_1: 1050, s11_2: 800, s11_3: 800,
    s12: 10000,
};

export const ASKILL_PREREQ = {
    s1: [],
    s2_1: ['s1'], s2_2: ['s1'],
    s3_1: ['s2_1'], s3_2: ['s2_2'],
    s4: ['s3_1', 's3_2'], // 3-1 または 3-2
    s5_1: ['s4'], s5_2: ['s4'], s5_3: ['s4'],
    s6_1: ['s5_1'], s6_2: ['s5_2'], s6_3: ['s5_3'],
    s7_1: ['s6_1'], s7_2: ['s6_2'], s7_3: ['s6_3'],
    s8: ['s7_1', 's7_2', 's7_3'],
    s9_1: ['s8'], s9_2: ['s8'],
    s10_1: ['s9_1'], s10_2: ['s9_2'], s10_3: ['s9_2'],
    s11_1: ['s10_1'], s11_2: ['s10_2'], s11_3: ['s10_3'],
    s12: ['s11_1', 's11_2', 's11_3']
};

export const ASKILL_POS = {
    s1: { x: 50, y: 12 },
    s2_1: { x: 34, y: 35 }, s2_2: { x: 66, y: 35 },
    s3_1: { x: 34, y: 60 }, s3_2: { x: 66, y: 60 },
    s4: { x: 50, y: 85 },
    s5_1: { x: 17, y: 110 }, s5_2: { x: 50, y: 110 }, s5_3: { x: 83, y: 110 },
    s6_1: { x: 17, y: 135 }, s6_2: { x: 50, y: 135 }, s6_3: { x: 83, y: 135 },
    s7_1: { x: 17, y: 160 }, s7_2: { x: 50, y: 160 }, s7_3: { x: 83, y: 160 },
    s8: { x: 50, y: 185 },
    s9_1: { x: 34, y: 210 }, s9_2: { x: 66, y: 210 },
    s10_1: { x: 17, y: 235 }, s10_2: { x: 50, y: 235 }, s10_3: { x: 83, y: 235 },
    s11_1: { x: 17, y: 260 }, s11_2: { x: 50, y: 260 }, s11_3: { x: 83, y: 260 },
    s12: { x: 50, y: 285 },
};

export const ASKILL_EDGES = [
    ['s1', 's2_1'], ['s1', 's2_2'],
    ['s2_1', 's3_1'], ['s2_2', 's3_2'],
    ['s3_1', 's4'], ['s3_2', 's4'],
    ['s4', 's5_1'], ['s4', 's5_2'], ['s4', 's5_3'],
    ['s5_1', 's6_1'], ['s5_2', 's6_2'], ['s5_3', 's6_3'],
    ['s6_1', 's7_1'], ['s6_2', 's7_2'], ['s6_3', 's7_3'],
    ['s7_1', 's8'], ['s7_2', 's8'], ['s7_3', 's8'],
    ['s8', 's9_1'], ['s8', 's9_2'],
    ['s9_1', 's10_1'], ['s9_2', 's10_2'], ['s9_2', 's10_3'],
    ['s10_1', 's11_1'], ['s10_2', 's11_2'], ['s10_3', 's11_3'],
    ['s11_1', 's12'], ['s11_2', 's12'], ['s11_3', 's12'],
];

export const ASKILL_LABELS = {
    s1: '1 スターターセット',
    s2_1: '2-1 スタートダッシュ',
    s2_2: '2-2 指数追加',
    s3_1: '3-1 AP温存界隈',
    s3_2: '3-2 集中力',
    s4: '4 強欲なドロー',
    s5_1: '5-1 準備万端',
    s5_2: '5-2 ブースト中毒',
    s5_3: '5-3 じわじわ8',
    s6_1: '6-1 値切り上手',
    s6_2: '6-2 狂気的な収穫',
    s6_3: '6-3 冒涜的な栽培',
    s7_1: '7-1 ハッピープレゼント',
    s7_2: '7-2 こしあんパワー',
    s7_3: '7-3 つぶあんパワー',
    s8: '8 タイムアタック開始',
    s9_1: '9-1 義務的な周回',
    s9_2: '9-2 二毛作',
    s10_1: '10-1 Idleな発想',
    s10_2: '10-2 大福パワー',
    s10_3: '10-3 ブーストのブースト',
    s11_1: '11-1 Idleな作戦',
    s11_2: '11-2 大福パワー',
    s11_3: '11-3 増加する指数',
    s12: '12 旅の準備',
};

export function getASkillLabel(id) {
    return ASKILL_LABELS[id] ?? id;
}

export const ASKILL_DESC = {
    s1: 'ずんだディメンションの自動購入（低速）と枝豆が常にアンロックされ、アンコニティ開始時にずんだディメンション1を10個所持した状態になる。',
    s2_1: 'ZPSが25倍に強化される。',
    s2_2: 'ZPSの指数に0.05が追加される。',
    s3_1: '未使用のAPに応じて全てのずんだディメンションの効率が強化(現在x1.00)',
    s3_2: 'アセンションの効力倍率が^1.2で強化。',
    s4: 'APの入手量が2倍に強化。',
    s5_1: 'アンコニティ開始時にずんだブーストを20個所持した状態になる。',
    s5_2: 'ブースト1個あたりの倍率を20%強化。',
    s5_3: 'ずんだディメンション8の効率を(所有数*4)%強化。',
    s6_1: 'アンコニティ開始時にコストプレステージがレベル15になる。',
    s6_2: '枝豆入手量を5倍に強化。',
    s6_3: 'SoyPSを3加算。',
    s7_1: 'アンコニティ開始時にずんだディメンション2～6を1個所持した状態になる。',
    s7_2: 'あんこディメンション1の効率を3倍に強化。',
    s7_3: 'あんこディメンション2の効率を1.5倍に強化。',
    s8: 'あんこチャレンジの合計最速クリア時間に応じてAPの入手量が増加(現在x1.00)',
    s9_1: 'アンコニティ達成回数に応じて全あんこディメンションの効率を強化(現在x1.00)',
    s9_2: 'ずんだディメンションを購入時、大豆を0.1入手。',
    s10_1: '最速アンコニティ時間x10が経過するごとにAPを1増加(この効果はオフラインでも発動する)',
    s10_2: 'あんこディメンション3の効率を1.3倍に強化。',
    s10_3: 'あんこチャレンジ4の最速クリア時間に応じてブーストの効力倍率を強化(現在x1.00)',
    s11_1: '最速アンコニティ時間x10が経過するごとにアンコニティ達成回数を1増加(この効果はオフラインでも発動する)',
    s11_2: '全てのずんだディメンションの効率を8倍に強化。',
    s11_3: 'あんこチャレンジ13の最速クリア時間に応じてZPSに指数が追加される(現在+0.00)',
    s12: 'あんこを10000所持した状態でアンコニティを開始する。'
}

export function getASkillDesc(id) {
    return ASKILL_DESC[id] ?? id;
}